dannyf00/Another-Arduino-Clone/pic24duino.h
#ifndef _PIC24DUINO_H
#define _PIC24DUINO_H

//PIC24duino code
// - using PIC24FJxxGA family
// - free running timer2 for ticks, pwm and input capture
// - 
// - version history
// - v2, 5/15/2021: simplified port
// - 
//
//              |=====================|
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |                     |
//              |=====================|
//
//
//

#include <xc.h>								//we use xc32
#include <stdint.h>							//we use uint types

//hardware configuration
//uart1 pin configuration
#define U1TX2RP()			PPS_U1TX_TO_RP(0)			//map u1tx pin to an rp pin
#define U1RX2RP()			PPS_U1RX_TO_RP(1)			//map u1rx pin to an rp pin

//uart2 pin configuration
#define U2TX2RP()			PPS_U2TX_TO_RP(0)			//u2tx pin
#define U2RX2RP()			PPS_U2RX_TO_RP(1)			//u2rx pin

//pwm/oc pin configuration
#define PWM12RP()			PPS_OC1_TO_RP(5)			//oc1 pin: 
#define PWM22RP()			PPS_OC2_TO_RP(5)			//oc2 pin: 
#define PWM32RP()			PPS_OC3_TO_RP(5)			//oc3 pin: 
#define PWM42RP()			PPS_OC4_TO_RP(5)			//oc4 pin: 
#define PWM52RP()			PPS_OC5_TO_RP(5)			//oc5 pin: 

//input capture pin configuration
#define IC12RP()			PPS_IC1_TO_RP(4)			//ic1 pin: 
#define IC22RP()			PPS_IC2_TO_RP(4)			//ic2 pin:
#define IC32RP()			PPS_IC3_TO_RP(4)			//ic3 pin: 
#define IC42RP()			PPS_IC4_TO_RP(4)			//ic4 pin: 
#define IC52RP()			PPS_IC5_TO_RP(4)			//ic5 pin: 

//extint pin configuration
//#define INT02RP()			PPS_INT0_TO_RP(7)			//int0 pin: fixed to rp7
#define INT12RP()			PPS_INT1_TO_RP(5)			//int1 pin: 
#define INT22RP()			PPS_INT2_TO_RP(5)			//int2 pin: 
//#define INT32RP()			PPS_INT3_TO_RP(5)			//int3 pin: 
//#define INT42RP()			PPS_INT4_TO_RP(5)			//int4 pin: 
//end pin configuration

//oscillator configuration
#define F_XTAL				8000000ul		//crystal frequency, user-specified
#define F_SOSC				32768			//SOSC = 32768Hz, user-specified
//end user specification

#define F_PHB				(F_FRC*1/2)		//cpu runs at 8Mhz/2 by default -> Fxtal = 8Mhz. *4 for PLL. RCDIV set to 0 (1:1 postscaler)
#define F_CPU				(CLKDIVbits.DOZEN?(F_PHB >> CLKDIVbits.DOZE):(F_PHB))			//peripheral block runs at F_PHB - default = F_CPU / 1
#define F_FRC				8000000ul		//FRC frequency = 8Mhz, fixed
#define F_LPRC				31000			//LPRC = 31Khz, fixed

#define PWM_PR				0xffff			//pwm period - don't change

//port manipulation macros for PIC.
#define IO_SET(port, bits)              port |= (bits)			//set bits on port
#define IO_CLR(port, bits)              port &=~(bits)			//clear bits on port
#define IO_FLP(port, bits)              port ^= (bits)			//flip bits on port
#define IO_GET(port, bits)              ((port) & (bits))		//return bits on port
#define IO_OUT(ddr, bits)               ddr &=~(bits)			//set bits as output
#define IO_IN(ddr, bits)                ddr |= (bits)			//set bits as input

//if gpio_typedef is used
#define GIO_SET(port, bits)              port->LAT |= (bits)			//set bits on port
#define GIO_CLR(port, bits)              port->LAT &=~(bits)			//clear bits on port
#define GIO_FLP(port, bits)              port->LAT ^= (bits)			//flip bits on port
#define GIO_GET(port, bits)              ((port->PORT) & (bits))		//return bits on port
#define GIO_OUT(port, bits)              port->TRIS &=~(bits)			//set bits as output
#define GIO_IN(port, bits)               port->TRIS |= (bits)			//set bits as input

//fast port operations
#define FIO_SET(port, bits)              port->LATSET = (bits)			//set bits on port
#define FIO_CLR(port, bits)              port->LATCLR = (bits)			//clear bits on port
#define FIO_FLP(port, bits)              port->LATINV = (bits)			//flip bits on port
#define FIO_GET(port, bits)              ((port->PORT) & (bits))		//return bits on port
#define FIO_OUT(port, bits)              port->TRISCLR = (bits)			//set bits as output
#define FIO_IN(port, bits)               port->TRISSET = (bits)			//set bits as input

#define NOP()				Nop()                           //asm("nop")					//nop()
#define NOP2()				{NOP(); NOP();}
#define NOP4()				{NOP2(); NOP2();}
#define NOP8()				{NOP4(); NOP4();}
#define NOP16()				{NOP8(); NOP8();}
#define NOP16()				{NOP8(); NOP8();}
#define NOP24()				{NOP16(); NOP8();}
#define NOP32()				{NOP16(); NOP16();}
#define NOP40()				{NOP32(); NOP8();}
#define NOP64()				{NOP32(); NOP32();}

#define sleep()				asm("sleep")					//put the mcu into sleep

#ifndef ei
#define ei()				//asm volatile ("ei")				//__builtin_enable_interrupts()	//do {INTEnableInterrupts();	INTEnableSystemMultiVectoredInt();} while (0)	//__builtin_enable_interrupts()
#endif

#ifndef di
#define di()				//asm volatile ("di")				//__builtin_enable_interrupts()	//INTDisableInterrupts()			//__builtin_disable_interrupts()	//
#endif

//iolock/unlock sequence
//unlock IOLOCK
#define IO_UNLOCK()	{asm volatile ( "MOV #OSCCON, w1 \n" \
					"MOV #0x46, w2 \n" \
					"MOV #0x57, w3 \n" \
					"MOV.b w2, [w1] \n" \
					"MOV.b w3, [w1] \n" \
					"BCLR OSCCON,#6"); \
					}

//lock IOLOCK
#define IO_LOCK()	{asm volatile ( "MOV #OSCCON, w1 \n" \
					"MOV #0x46, w2 \n" \
					"MOV #0x57, w3 \n" \
					"MOV.b w2, [w1] \n" \
					"MOV.b w3, [w1] \n" \
					"BSET OSCCON, #6" ); \
					}

//pps macros
//more on macro
//macros for remappable pins
//for peripheral pin select (PPS)
#if defined(_INT1R)
/// Maps INT1 to a remappable pin;
/// see PPS_xxx_TO_RP(pin) for more informatino.
#define PPS_INT1_TO_RP(pin) _INT1R = pin
#else
#define PPS_INT1_TO_RP(pin)
#endif


